GreatCowBASIC/DATFileGenerator/incfiles/p18f25k83.inc
;----- DMA1DSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA1DSA0         EQU  H'0000'
DMA1DSA1         EQU  H'0001'
DMA1DSA2         EQU  H'0002'
DMA1DSA3         EQU  H'0003'
DMA1DSA4         EQU  H'0004'
DMA1DSA5         EQU  H'0005'
DMA1DSA6         EQU  H'0006'
DMA1DSA7         EQU  H'0007'


;----- DMA1DSAH Bits -----------------------------------------------------
DSA8             EQU  H'0000'
DSA9             EQU  H'0001'
DSA10            EQU  H'0002'
DSA11            EQU  H'0003'
DSA12            EQU  H'0004'
DSA13            EQU  H'0005'
DSA14            EQU  H'0006'
DSA15            EQU  H'0007'


DMA1DSA8         EQU  H'0000'
DMA1DSA9         EQU  H'0001'
DMA1DSA10        EQU  H'0002'
DMA1DSA11        EQU  H'0003'
DMA1DSA12        EQU  H'0004'
DMA1DSA13        EQU  H'0005'
DMA1DSA14        EQU  H'0006'
DMA1DSA15        EQU  H'0007'


;----- DMA1SCNTL Bits -----------------------------------------------------
SCNT0            EQU  H'0000'
SCNT1            EQU  H'0001'
SCNT2            EQU  H'0002'
SCNT3            EQU  H'0003'
SCNT4            EQU  H'0004'
SCNT5            EQU  H'0005'
SCNT6            EQU  H'0006'
SCNT7            EQU  H'0007'


DMA1SCNT0        EQU  H'0000'
DMA1SCNT1        EQU  H'0001'
DMA1SCNT2        EQU  H'0002'
DMA1SCNT3        EQU  H'0003'
DMA1SCNT4        EQU  H'0004'
DMA1SCNT5        EQU  H'0005'
DMA1SCNT6        EQU  H'0006'
DMA1SCNT7        EQU  H'0007'


;----- DMA1SCNTH Bits -----------------------------------------------------
SCNT8            EQU  H'0000'
SCNT9            EQU  H'0001'
SCNT10           EQU  H'0002'
SCNT11           EQU  H'0003'


DMA1SCNT8        EQU  H'0000'
DMA1SCNT9        EQU  H'0001'
DMA1SCNT10       EQU  H'0002'
DMA1SCNT11       EQU  H'0003'


;----- DMA1SPTRL Bits -----------------------------------------------------
SPTR0            EQU  H'0000'
SPTR1            EQU  H'0001'
SPTR2            EQU  H'0002'
SPTR3            EQU  H'0003'
SPTR4            EQU  H'0004'
SPTR5            EQU  H'0005'
SPTR6            EQU  H'0006'
SPTR7            EQU  H'0007'


DMA1SPTR0        EQU  H'0000'
DMA1SPTR1        EQU  H'0001'
DMA1SPTR2        EQU  H'0002'
DMA1SPTR3        EQU  H'0003'
DMA1SPTR4        EQU  H'0004'
DMA1SPTR5        EQU  H'0005'
DMA1SPTR6        EQU  H'0006'
DMA1SPTR7        EQU  H'0007'


;----- DMA1SPTRH Bits -----------------------------------------------------
SPTR8            EQU  H'0000'
SPTR9            EQU  H'0001'
SPTR10           EQU  H'0002'
SPTR11           EQU  H'0003'
SPTR12           EQU  H'0004'
SPTR13           EQU  H'0005'
SPTR14           EQU  H'0006'
SPTR15           EQU  H'0007'


DMA1SPTR8        EQU  H'0000'
DMA1SPTR9        EQU  H'0001'
DMA1SPTR10       EQU  H'0002'
DMA1SPTR11       EQU  H'0003'
DMA1SPTR12       EQU  H'0004'
DMA1SPTR13       EQU  H'0005'
DMA1SPTR14       EQU  H'0006'
DMA1SPTR15       EQU  H'0007'


;----- DMA1SPTRU Bits -----------------------------------------------------
SPTR16           EQU  H'0000'
SPTR17           EQU  H'0001'
SPTR18           EQU  H'0002'
SPTR19           EQU  H'0003'
SPTR20           EQU  H'0004'
SPTR21           EQU  H'0005'


DMA1SPTR16       EQU  H'0000'
DMA1SPTR17       EQU  H'0001'
DMA1SPTR18       EQU  H'0002'
DMA1SPTR19       EQU  H'0003'
DMA1SPTR20       EQU  H'0004'
DMA1SPTR21       EQU  H'0005'


;----- DMA1SSZL Bits -----------------------------------------------------
SSZ0             EQU  H'0000'
SSZ1             EQU  H'0001'
SSZ2             EQU  H'0002'
SSZ3             EQU  H'0003'
SSZ4             EQU  H'0004'
SSZ5             EQU  H'0005'
SSZ6             EQU  H'0006'
SSZ7             EQU  H'0007'

DMA1SSZ0         EQU  H'0000'
DMA1SSZ1         EQU  H'0001'
DMA1SSZ2         EQU  H'0002'
DMA1SSZ3         EQU  H'0003'
DMA1SSZ4         EQU  H'0004'
DMA1SSZ5         EQU  H'0005'
DMA1SSZ6         EQU  H'0006'
DMA1SSZ7         EQU  H'0007'


;----- DMA1SSZH Bits -----------------------------------------------------
SSZ8             EQU  H'0000'
SSZ9             EQU  H'0001'
SSZ10            EQU  H'0002'
SSZ11            EQU  H'0003'

DMA1SSZ8         EQU  H'0000'
DMA1SSZ9         EQU  H'0001'
DMA1SSZ10        EQU  H'0002'
DMA1SSZ11        EQU  H'0003'


;----- DMA1SSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA1SSA0         EQU  H'0000'
DMA1SSA1         EQU  H'0001'
DMA1SSA2         EQU  H'0002'
DMA1SSA3         EQU  H'0003'
DMA1SSA4         EQU  H'0004'
DMA1SSA5         EQU  H'0005'
DMA1SSA6         EQU  H'0006'
DMA1SSA7         EQU  H'0007'


;----- DMA1SSAH Bits -----------------------------------------------------
SSA8             EQU  H'0000'
SSA9             EQU  H'0001'
SSA10            EQU  H'0002'
SSA11            EQU  H'0003'
SSA12            EQU  H'0004'
SSA13            EQU  H'0005'
SSA14            EQU  H'0006'
SSA15            EQU  H'0007'


DMA1SSA8         EQU  H'0000'
DMA1SSA9         EQU  H'0001'
DMA1SSA10        EQU  H'0002'
DMA1SSA11        EQU  H'0003'
DMA1SSA12        EQU  H'0004'
DMA1SSA13        EQU  H'0005'
DMA1SSA14        EQU  H'0006'
DMA1SSA15        EQU  H'0007'


;----- DMA1SSAU Bits -----------------------------------------------------
SSA16            EQU  H'0000'
SSA17            EQU  H'0001'
SSA18            EQU  H'0002'
SSA19            EQU  H'0003'
SSA20            EQU  H'0004'
SSA21            EQU  H'0005'


DMA1SSA16        EQU  H'0000'
DMA1SSA17        EQU  H'0001'
DMA1SSA18        EQU  H'0002'
DMA1SSA19        EQU  H'0003'
DMA1SSA20        EQU  H'0004'
DMA1SSA21        EQU  H'0005'


;----- DMA1CON0 Bits -----------------------------------------------------
XIP              EQU  H'0000'
AIRQEN           EQU  H'0002'
DGO              EQU  H'0005'
SIRQEN           EQU  H'0006'
EN               EQU  H'0007'

DMA1XIP          EQU  H'0000'
DMA1AIRQEN       EQU  H'0002'
DMA1DGO          EQU  H'0005'
DMA1SIRQEN       EQU  H'0006'
DMA1EN           EQU  H'0007'


;----- DMA1CON1 Bits -----------------------------------------------------
SSTP             EQU  H'0000'
DSTP             EQU  H'0005'


;----- DMA1AIRQ Bits -----------------------------------------------------
AIRQ0            EQU  H'0000'
AIRQ1            EQU  H'0001'
AIRQ2            EQU  H'0002'
AIRQ3            EQU  H'0003'
AIRQ4            EQU  H'0004'
AIRQ5            EQU  H'0005'
AIRQ6            EQU  H'0006'
AIRQ7            EQU  H'0007'

DMA1AIRQ0        EQU  H'0000'
DMA1AIRQ1        EQU  H'0001'
DMA1AIRQ2        EQU  H'0002'
DMA1AIRQ3        EQU  H'0003'
DMA1AIRQ4        EQU  H'0004'
DMA1AIRQ5        EQU  H'0005'
DMA1AIRQ6        EQU  H'0006'
DMA1AIRQ7        EQU  H'0007'


;----- DMA1SIRQ Bits -----------------------------------------------------
SIRQ0            EQU  H'0000'
SIRQ1            EQU  H'0001'
SIRQ2            EQU  H'0002'
SIRQ3            EQU  H'0003'
SIRQ4            EQU  H'0004'
SIRQ5            EQU  H'0005'
SIRQ6            EQU  H'0006'
SIRQ7            EQU  H'0007'

DMA1SIRQ0        EQU  H'0000'
DMA1SIRQ1        EQU  H'0001'
DMA1SIRQ2        EQU  H'0002'
DMA1SIRQ3        EQU  H'0003'
DMA1SIRQ4        EQU  H'0004'
DMA1SIRQ5        EQU  H'0005'
DMA1SIRQ6        EQU  H'0006'
DMA1SIRQ7        EQU  H'0007'


